test/request-response-samples/Dummy__should_handle_inline_types/request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope
  xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:tns="http://www.Dummy.com"
  xmlns:n="http://www.Dummy.com/Name/Types"
>
  <soap:Body>
    <n:DummyRequest xmlns:n="http://www.Dummy.com/Name/Types">
    </n:DummyRequest>
  </soap:Body>
</soap:Envelope>
