test/request-response-samples/Dummy__should_parse_nil/request.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<soap:Envelope  xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Header/>
<soap:Body>
		<ns1:DummyRequest xmlns:ns1="http://www.Dummy.com/Name/Types">
            <ns1:DummyField1>Humpty</ns1:DummyField1>
            <ns1:DummyFilter>
                 <ns2:DummyStringFilter xmlns:ns2="http://www.Dummy.com/Common/Types" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
                 <ns2:DummyDateFilter xmlns:ns2="http://www.Dummy.com/Common/Types" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
            </ns1:DummyFilter>
        </ns1:DummyRequest>
</soap:Body>
</soap:Envelope>